In [2]:
import pandas as pd
import numpy as np

In [3]:
data= pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [6]:
data['temperature'].value_counts()

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [ ]:
#return the frequency

In [7]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [8]:
# check the duplicate value
data['temperature'].duplicated()

0    False
1    False
2    False
3     True
4     True
5    False
6    False
Name: temperature, dtype: bool

In [9]:
# checking for duplicates specific temperature column
data[data['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [11]:
data[data['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [13]:
data['event'].value_counts()

Rain     2
0        2
Sunny    2
Snow     1
Name: event, dtype: int64

In [8]:
df= pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [26]:
new_df=df.replace({'temperature': -99999,'windspeed':-99999,'event':'0'},np.nan)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

### Imputation: imputation is a process of substituting the missing value

In [27]:
new_df.isnull().sum() # check the null value

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [28]:
# fillna() is a function which is used to fill the missing value
data=new_df.fillna(0) # we fill the null value =0
data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          0.0        7.0  Sunny
2  1/3/2017         28.0        0.0   Snow
3  1/4/2017          0.0        7.0      0
4  1/5/2017         32.0        0.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

In [29]:
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0    NaN
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [30]:
data=new_df.fillna(1) # we fill the null value =1
data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          1.0        7.0  Sunny
2  1/3/2017         28.0        1.0   Snow
3  1/4/2017          1.0        7.0      1
4  1/5/2017         32.0        1.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      1

In [32]:
 # we can fill the prev value place of nan value using this method
f_data=new_df.fillna(method='ffill')
f_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         32.0        7.0  Sunny
2  1/3/2017         28.0        7.0   Snow
3  1/4/2017         28.0        7.0   Snow
4  1/5/2017         32.0        7.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

In [33]:
## bfill--- backfill
b_data =new_df.fillna(method='bfill')
b_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         28.0        7.0  Sunny
2  1/3/2017         28.0        7.0   Snow
3  1/4/2017         32.0        7.0   Rain
4  1/5/2017         32.0        2.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [34]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [36]:
# fill the missing value in a column with the column's value
mean_data =new_df.fillna(new_df.mean())
mean_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         31.4        7.0  Sunny
2  1/3/2017         28.0        5.4   Snow
3  1/4/2017         31.4        7.0    NaN
4  1/5/2017         32.0        5.4   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [39]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [40]:
## Median Imputation

median_data = new_df.fillna(new_df.median())
median_data

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017         32.0        7.0  Sunny
2  1/3/2017         28.0        6.0   Snow
3  1/4/2017         32.0        7.0    NaN
4  1/5/2017         32.0        6.0   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0    NaN

In [42]:
new_df['event']

0     Rain
1    Sunny
2     Snow
3      NaN
4     Rain
5    Sunny
6      NaN
Name: event, dtype: object

In [43]:
new_df.event.mode()

0     Rain
1    Sunny
dtype: object

In [44]:
new_df.event.mode().iloc[0]

'Rain'

In [45]:
new_df.event.mode().iloc[1]

'Sunny'

In [48]:
new_df['event']=new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0   Rain
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0   Rain